Revit 2026 API
PathOfTravel.UpdateMultiple Method
Overload List
Name | Description
UpdateMultiple(Document, IList<ElementId>)
UpdateMultiple(Document, IList<ElementId>, IList<PathOfTravelCalculationStatus>)
Top
See Also
Reference
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace